SetASNZS117022002
Syntax
SapObject.SapModel.LoadPatterns.AutoWind.SetASNZS117022002
VB6 Procedure
Function SetASNZS117022002(ByVal Name As String, ByVal ExposureFrom As Long, ByVal DirAngle As Double, ByVal Cpw As Double, ByVal Cpl As Double, ByVal Ka As Double, ByVal Kc As Double, ByVal Kl As Double, ByVal Kp As Double, ByVal UserZ As Boolean, ByVal TopZ As Double, ByVal BottomZ As Double, ByVal WindSpeed As Double, ByVal Cat As Long, ByVal CycloneRegion As Boolean, ByVal Md As Double, ByVal Ms As Double, ByVal Mt As Double, ByVal Cdyn As Double, Optional ByVal UserExposure As Boolean = False) As Long
Parameters
Name
The name of an existing Wind-type load case.
ExposureFrom
This is 1, or 2, indicating the source of the wind exposure.
1 = From extents of rigid diaphragms
2 = From area objects
DirAngle
The direction angle for the wind load.
Cpw
The windward coefficient, Cp. This item applies only when ExposureFrom = 1.
Cpl
The leeward coefficient, Cp. This item applies only when ExposureFrom = 1.
Ka
The area reduction factor, Ka.
Kc
The combination factor, Kc.
Kl
The local pressure factor, Kl.
Kp
The porous cladding factor, Kp.
UserZ
This item is True if the top and bottom elevations of the wind load are user specified. It is False if the elevations are determined by the program.
TopZ
This item is the global Z-coordinate at the highest level where auto wind loads are applied. [L]
BottomZ
This item is the global Z-coordinate at the lowest level where auto wind loads are applied. [L]
WindSpeed
The regional wind speed, Vr, in m/s.
Cat
This is 1, 2, 3 or 4, indicating the terrain category.
CycloneRegion
This is True or False, indicating if the structure is in a cyclone region.
Md
The directional multiplier, Md.
Ms
The shielding multiplier, Ms.
Mt
The topographic multiplier, Mt.
Cdyn
The dynamic response factor, Cdyn.
UserExposure
If this item is True, the wind exposure widths are provided by the user. If it is False, the wind exposure widths are calculated by the program from the extents of the diaphragms.
Remarks
This function assigns auto wind loading parameters for AS/NZS 1170.2:2002.
The function returns zero if the parameters are successfully assigned; otherwise, it returns a nonzero value.
VBA Example
Sub AssignWindASNZS117022002()
 'dimension variables
 Dim SapObject as cOAPI
 Dim SapModel As cSapModel
 Dim ret As Long
 'create Sap2000 object
 Set SapObject = CreateObject("CSI.SAP2000.API.SapObject")
 'start Sap2000 application
 SapObject.ApplicationStart
 'create SapModel object
 Set SapModel = SapObject.SapModel
 'initialize model
 ret = SapModel.InitializeNewModel
 'create model from template
 ret = SapModel.File.New3DFrame(BeamSlab, 2, 144, 3, 336, 2, 432)
 'add new load case
 ret = SapModel.LoadPatterns.Add("WIND", LTYPE_WIND)
 'assign AS/NZS 1170.2:2002 parameters
 ret = SapModel.LoadPatterns.AutoWind.SetASNZS117022002("WIND", 1, 0, 0.8, 0.5, 1, 1, 1, 1, False, 0, 0, 50, 2, False, 1, 1, 1, 1)
 'close Sap2000
 SapObject.ApplicationExit False
 Set SapModel = Nothing
 Set SapObject = Nothing
 End Sub
Release Notes
Initial release in version 14.1.0.
See Also
GetASNZS117022002